app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
	def index
		@post = Post.all.order('created_at DESC')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "zackk"], ["body", "kaozkkeakz"], ["created_at", "2015-12-20 15:27:54.559058"], ["updated_at", "2015-12-20 15:27:54.559058"]]
---
	def create
		@post = Post.new(post_params)
		@post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "zackokezko"], ["body", "text1"], ["updated_at", "2015-12-20 18:04:04.402079"], ["id", 8]]
---
	def update
	  @post = Post.find(params[:id])

	  if @post.update(post_params)